holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Main style: radius
    lv_obj_set_style_radius(result.menu, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.menu, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.menu, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.menu, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.menu, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.menu, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.menu, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.menu, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.menu, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.menu, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.menu, font_menu_item, LV_PART_MAIN);

    /* --- MENU LV_PART_ITEMS ---------------------------------------------------------- */

    lv_obj_set_style_border_width(result.menu, border_width, LV_PART_ITEMS);

    /* --- MAIN HEADER ----------------------------------------------------------------- */

    // Create main header
    result.main_header = lv_menu_get_main_header(result.menu);

    /* --- MAIN HEADER LV_PART_MAIN ---------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_all(result.main_header, 12, LV_PART_MAIN);

    // Main style: radius
    lv_obj_set_style_radius(result.main_header, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.main_header, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.main_header, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.main_header, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.main_header, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.main_header, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.main_header, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.main_header, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.main_header, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.main_header, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.main_header, font_menu_title, LV_PART_MAIN);

    /* --- ROOT BACK BUTTON ------------------------------------------------------------ */
    
    // Enable root back button
    lv_menu_set_mode_root_back_button(result.menu, LV_MENU_ROOT_BACK_BUTTON_ENABLED);

    // Create back button
    result.back_button = lv_menu_get_main_header_back_button(result.menu);

    // Create back button label
    result.back_label = lv_obj_get_child(result.back_button, 0);

    /* --- ROOT BACK BUTTON LV_PART_MAIN ------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_all(result.back_button, 8, LV_PART_MAIN);

    // Main style: radius
    lv_obj_set_style_radius(result.back_button, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.back_button, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.back_button, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.back_button, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.back_button, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.back_button, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.back_button, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.back_button, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.back_button, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.back_button, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.back_button, font_menu_item, LV_PART_MAIN);

    /* --- ROOT BACK BUTTON LABEL LV_PART_MAIN ----------------------------------------- */

    // Main style: radius
    lv_obj_set_style_radius(result.back_label, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.back_label, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.back_label, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.back_label, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.back_label, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.back_label, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.back_label, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.back_label, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.back_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.back_label, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.back_label, font_menu_item, LV_PART_MAIN);

    /* --- CREATE PAGES ----------------------------------------------------------------- */

    // Create Pages
    for(int i = 0; i < max_pages && page_titles[i] != NULL; i++) {
        result.pages[i] = create_menu_page(result.menu, page_titles[i]);
        result.page_count++;
    }

    // Add main menu items to first page if provided
    if(main_menu_items && result.pages[0]) {
        for(int i = 0; main_menu_items[i] != NULL; i++) {
            create_menu_item(&result, 0, main_menu_items[i]);
        }
    }
    
    // Set current page
    lv_menu_set_page(result.menu, result.pages[0]);

    return result;
}

/** ----------------------------------------------------------------------------------------
 * @brief Creates Menu Grid.
 * 
 * Intention is to be resusable, flexible & while providing a consistent style.
 * 
 * @param scr Pointer to the parent screen object.
 * @param menu_grid Pointer to the parent menu_grid object.
 * @param cols Number of columns in the grid.
 * @param rows Number of rows in the grid.
 * @param cell_size_px Size of each cell in pixels.
 * @param outer_padding Padding around the grid in pixels.
 * @param inner_padding Padding between cells in pixels.
 * @param pos_x X position of the grid within its parent/screen.
 * @param pos_y Y position of the grid within its parent/screen.
 * @param alignment Alignment of the grid within its parent/screen.
 * @param item_radius Radius of the grid items in pixels.
 * @param max_cols_visible Maximum number of columns visible.
 * @param max_rows_visible Maximum number of rows visible.
 * @param show_scrollbar If true, scrollbars will always be shown.
 * @param enable_scrolling If true, scrolling will be enabled for the grid.
 * @return Pointer to the created grid_menu object.
 */
lv_obj_t * create_menu_grid(
    lv_obj_t *scr,
    // lv_obj_t * grid_menu,
    const int32_t cols,
    const int32_t rows,
    const int32_t cell_size_px,
    const int32_t outer_padding,
    const int32_t inner_padding,
    const int32_t pos_x,
    const int32_t pos_y,
    lv_align_t alignment,
    int32_t item_radius,
    int32_t max_cols_visible,
    int32_t max_rows_visible,
    bool show_scrollbar,
    bool enable_scrolling,
    lv_text_align_t text_align,
    const lv_font_t * font,
    bool transparent_bg,
    bool transparent_outline
    )
{
    /* ---- GRID MENU CONFIGURATION ---------------------------------------------------- */

    const int32_t GRID_MENU_X_CELL_SIZE_PX = cell_size_px; // Set cell size in pixels
    const int32_t GRID_MENU_X_MAX_COLS = cols;
    const int32_t GRID_MENU_X_MAX_ROWS = rows;
    #define GRID_MENU_X_OUTER_PADDING outer_padding // Set space around grid
    #define GRID_MENU_X_INNER_PADDING inner_padding // Set space between cells
    #define GRID_MENU_X_SCROLLBAR_OFFSET 12 // Set scrollbar offset when scrolling enabled

    // Set arrays
    #define GRID_MENU_X_TOTAL_CELLS (GRID_MENU_X_MAX_COLS * GRID_MENU_X_MAX_ROWS)
    lv_coord_t * grid_menu_x_col_dsc = (lv_coord_t *)malloc((GRID_MENU_X_MAX_COLS + 1) * sizeof(lv_coord_t));
    lv_coord_t * grid_menu_x_row_dsc = (lv_coord_t *)malloc((GRID_MENU_X_MAX_ROWS + 1) * sizeof(lv_coord_t));

    // Create grid object
    lv_obj_t * grid_menu = lv_obj_create(scr);

