holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_gps_precision = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_gps_precision_factor = create_label(
        row_gps_precision,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "GPS Precision",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gps_precision_factor = create_label(
        row_gps_precision,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gps_precision_factor, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gps_precision_factor, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Altitude                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_altitude = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_altitude = create_label(
        row_altitude,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Altitude",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_altitude = create_label(
        row_altitude,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_altitude, obj_w_0, obj_height);
    lv_obj_set_size(result.val_altitude, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Geoidal                                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_geoidal = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_geoidal = create_label(
        row_geoidal,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Geoidal",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_geoidal = create_label(
        row_geoidal,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_geoidal, obj_w_0, obj_height);
    lv_obj_set_size(result.val_geoidal, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Differential Delay                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_differential_delay = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_differential_delay = create_label(
        row_differential_delay,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Diff Delay",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_differential_delay = create_label(
        row_differential_delay,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_differential_delay, obj_w_0, obj_height);
    lv_obj_set_size(result.val_differential_delay, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Bad Elements                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_bad_elements = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_bad_element_count = create_label(
        row_bad_elements,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Bad Elements",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_bad_element_count = create_label(
        row_bad_elements,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_bad_element_count, obj_w_0, obj_height);
    lv_obj_set_size(result.val_bad_element_count, obj_w_1, obj_height);

    return result;
}

