holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_imu_kind = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_imu_kind = create_label(
        row_imu_kind,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "IMU Kind",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_imu_kind = create_label(
        row_imu_kind,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_imu_kind, obj_w_0, obj_height);
    lv_obj_set_size(result.val_imu_kind, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row UBI Car Kind                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_ubi_car_kind = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_ubi_car_kind = create_label(
        row_ubi_car_kind,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Ubi Car Kind",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ubi_car_kind = create_label(
        row_ubi_car_kind,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ubi_car_kind, obj_w_0, obj_height);
    lv_obj_set_size(result.val_ubi_car_kind, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Mileage                                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_mileage = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_mileage = create_label(
        row_mileage,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Mileage",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_mileage = create_label(
        row_mileage,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_mileage, obj_w_0, obj_height);
    lv_obj_set_size(result.val_mileage, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Run Inertial Flag                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_run_inertial_flag = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_run_inetial_flag = create_label(
        row_run_inertial_flag,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Run Inertial",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_run_inetial_flag = create_label(
        row_run_inertial_flag,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_run_inetial_flag, obj_w_0, obj_height);
    lv_obj_set_size(result.val_run_inetial_flag, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Speed Num                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_speed_num = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_speed_num = create_label(
        row_speed_num,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Speed Num",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_speed_num = create_label(
        row_speed_num,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_speed_num, obj_w_0, obj_height);
    lv_obj_set_size(result.val_speed_num, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Scalable                                               */
    /* ---------------------------------------------------------- */

