holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_size(result.lbl_user_speed, obj_w_0, obj_height);
    lv_obj_set_size(result.ta_user_speed, obj_w_1, obj_height);
    lv_obj_set_size(result.btn_auto_set_user_speed.panel, obj_w_2, obj_height);

    /* ---------------------------------------------------------- */
    /* Row System Speed                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_sys_speed = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_sys_speed = create_label(
        row_sys_speed,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[SYS] Speed",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_sys_speed = create_label(
        row_sys_speed,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_sys_speed, obj_w_0, obj_height);
    lv_obj_set_size(result.val_sys_speed, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Speed Mode                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_speed_mode = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = sub_row_width / 2;
    obj_w_1 = (sub_row_width / 4) - (sub_column_padding * 2);
    obj_w_2 = (sub_row_width / 4) - (sub_column_padding * 2);

    result.lbl_speed_mode = create_label(
        row_speed_mode,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Speed Mode",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.btn_speed_mode_gps = create_button(
        row_speed_mode,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "GPS",
        LV_TEXT_ALIGN_CENTER,
        false,
        false,
        &cobalt_alien_17,
        radius_rounded
    );
    lv_obj_add_event_cb(result.btn_speed_mode_gps.button, btn_speed_mode_gps_event_cb, LV_EVENT_CLICKED, NULL);

    result.btn_speed_mode_user = create_button(
        row_speed_mode,
        obj_w_2,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "User",
        LV_TEXT_ALIGN_CENTER,
        false,
        false,
        &cobalt_alien_17,
        radius_rounded
    );
    lv_obj_add_event_cb(result.btn_speed_mode_user.button, btn_speed_mode_user_event_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_set_size(result.lbl_speed_mode, obj_w_0, obj_height);
    lv_obj_set_size(result.btn_speed_mode_gps.panel, obj_w_1, obj_height);
    lv_obj_set_size(result.btn_speed_mode_user.panel, obj_w_2, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Heading                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_heading = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = sub_row_width;

    result.lbl_title_heading = create_label(
        row_title_heading,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "HEADING",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_title_heading, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Ground Heading Name                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_gps_gh_name = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_ground_heading_name = create_label(
        row_gps_gh_name,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] GH Name",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_ground_heading_name = create_label(
        row_gps_gh_name,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_ground_heading_name, obj_w_0, obj_height);
    lv_obj_set_size(result.val_ground_heading_name, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Ground Heading                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_gps_ground_heading = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

