holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_4 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250; // label
    obj_w_1 = (((width_px/1) *1) - obj_w_0) - (sub_column_padding*3);

    result.lbl_gyro_0_acc_y = create_label(
        row_4,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "G-Force Y",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_acc_y = create_label(
        row_4,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_acc_y, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_y, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 5: Acc Z                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_5 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250; // label
    obj_w_1 = (((width_px/1) *1) - obj_w_0) - (sub_column_padding*3);

    result.lbl_gyro_0_acc_z = create_label(
        row_5,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "G-Force Z",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_acc_z = create_label(
        row_5,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_acc_z, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_z, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 6: Gyro X (processed)                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_6 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250; // label
    obj_w_1 = (((width_px/1) *1) - obj_w_0) - (sub_column_padding*3);

    result.lbl_gyro_0_gyr_x = create_label(
        row_6,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Gyro X",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_gyr_x = create_label(
        row_6,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_gyr_x, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_x, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 7: Gyro Y                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_7 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250; // label
    obj_w_1 = (((width_px/1) *1) - obj_w_0) - (sub_column_padding*3);

    result.lbl_gyro_0_gyr_y = create_label(
        row_7,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Gyro Y",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_gyr_y = create_label(
        row_7,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_gyr_y, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_y, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 8: Gyro Z                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_8 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250; // label
    obj_w_1 = (((width_px/1) *1) - obj_w_0) - (sub_column_padding*3);

    result.lbl_gyro_0_gyr_z = create_label(
        row_8,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Gyro Z",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    result.val_gyro_0_gyr_z = create_label(
        row_8,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1
    );

    lv_obj_set_size(result.lbl_gyro_0_gyr_z, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_z, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 9: Mag X                                               */
    /* ---------------------------------------------------------- */

