holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Set row object widths
    obj_w_0 = 40; // label
    obj_w_2 = 110; // mode
    obj_w_1 = (sub_row_width) - obj_w_0 - obj_w_2 - (sub_column_padding*3);

    // Label Y
    result.label_y = create_label(
        row_value_y,          // parent
        obj_w_0,        // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Y",                  // initial text
        LV_TEXT_ALIGN_CENTER,   // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // User Y
    result.ta_y = create_textarea(
        row_value_y,     // lv_obj_t
        obj_w_1,   // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_CENTER
    );
    lv_textarea_set_text(result.ta_y, String("").c_str());
    lv_obj_add_event_cb(result.ta_y, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_y, &matrix_value_y_ctx);

    // System Y
    result.dd_y = create_dropdown_menu(
        row_value_y,
        NULL,
        0,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_y_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        snprintf(dd_y_name, sizeof(dd_y_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_y, dd_y_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_y, 0);
    lv_obj_add_event_cb(result.dd_y, dd_y_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    lv_obj_add_flag(result.dd_y, LV_OBJ_FLAG_HIDDEN);

    // Y Mode Select
    result.dd_mode_y = create_dropdown_menu(
        row_value_y,
        NULL,
        0,
        obj_w_2,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_y_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_XYZ_MODES; i++) {
        snprintf(dd_mode_y_name, sizeof(dd_mode_y_name), "%s", String(matrixData.matrix_function_mode_xyz_name[i]).c_str());
        lv_dropdown_add_option(result.dd_mode_y, dd_mode_y_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode_y, 0);
    lv_obj_add_event_cb(result.dd_mode_y, dd_mode_y_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_y, obj_w_0, obj_height);
    lv_obj_set_size(result.ta_y, obj_w_1, obj_height);
    lv_obj_set_size(result.dd_y, obj_w_1, obj_height);
    lv_obj_set_size(result.dd_mode_y, obj_w_2, obj_height);

    /* --- Z Value ------------------------------------------------------------- */
    
    lv_obj_t * row_value_z = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 40; // label
    obj_w_2 = 110; // mode
    obj_w_1 = (sub_row_width) - obj_w_0 - obj_w_2 - (sub_column_padding*3);

    // Label Z
    result.label_z = create_label(
        row_value_z,          // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Z",                  // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1
    );
    
    // User Z
    result.ta_z = create_textarea(
        row_value_z,     // lv_obj_t
        obj_w_1,         // width px
        obj_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_CENTER
    );
    lv_textarea_set_text(result.ta_z, String("").c_str());
    lv_obj_add_event_cb(result.ta_z, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_z, &matrix_value_z_ctx);

    // System Z
    result.dd_z = create_dropdown_menu(
        row_value_z,
        NULL,
        0,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_z_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        snprintf(dd_z_name, sizeof(dd_z_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_z, dd_z_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_z, 0);
    lv_obj_add_event_cb(result.dd_z, dd_z_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    lv_obj_add_flag(result.dd_z, LV_OBJ_FLAG_HIDDEN);

    // Z Mode Select
    result.dd_mode_z = create_dropdown_menu(
        row_value_z,
        NULL,
        0,
        obj_w_2,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_z_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_XYZ_MODES; i++) {
        snprintf(dd_mode_z_name, sizeof(dd_mode_z_name), "%s", String(matrixData.matrix_function_mode_xyz_name[i]).c_str());
        lv_dropdown_add_option(result.dd_mode_z, dd_mode_z_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode_z, 0);
    lv_obj_add_event_cb(result.dd_mode_z, dd_mode_z_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_z, obj_w_0, obj_height);
    lv_obj_set_size(result.ta_z, obj_w_1, obj_height);
    lv_obj_set_size(result.dd_z, obj_w_1, obj_height);
    lv_obj_set_size(result.dd_mode_z, obj_w_2, obj_height);
    
    /* --- Operator ------------------------------------------------------------ */
    
    lv_obj_t * row_operator = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

