holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    printf("[display_matrix_screen] invalidating display\n");
    lv_obj_invalidate(matrix_screen);  // Force redraw
    printf("[display_matrix_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** ------------------------------------------------------------------
 * @brief GPS Screen
 * 
 */
void display_gps_screen()
{
    // Set Display Flag
    printf("[display_gps_screen] setting display flag\n");
    flag_display_gps_screen = false;

    // Check Current Screen
    printf("[display_gps_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gps_screen) {
        printf("[display_gps_screen] screen already active, returning\n");
        return;
    }
    printf("[display_gps_screen] selected new screen, attempting to load new screen\n");

    // Always create a fresh screen
    printf("[display_gps_screen] creating screen object\n");
    gps_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_gps_screen] loading screen\n");
    lv_scr_load_anim(gps_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_gps_screen] creating default screen objects\n");
    create_default_screen_objects(gps_screen);

    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    int32_t menu_w_px = 550;
    int32_t menu_h_px = 400;
    int32_t menu_row_h_px = 34;

    // GPS Switch Panel
    gps_switch_panel = create_gps_switch_panel(
        gps_screen,       // parent
        400,              // width px
        40+(4*3),         // height px
        LV_ALIGN_TOP_MID, // alignment
        0,                // pos x
        90,               // pos y
        radius_rounded,   // radius
        4,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        8,                // main_row_padding
        8,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        48,               // row height
        false,            // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    // SATIO
    satio_c = create_satio_panel(
        gps_screen,       // parent
        menu_w_px,        // width px
        menu_h_px,        // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius
        2,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        2,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        48,               // row height
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // GNGGA
    gngga_c = create_gngga_panel(
        gps_screen,       // parent
        menu_w_px,        // width px
        menu_h_px,        // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius
        2,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        2,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        48,               // row height
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // GNRMC
    gnrmc_c = create_gnrmc_panel(
        gps_screen,       // parent
        menu_w_px,        // width px
        menu_h_px,        // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius
        2,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        2,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        48,               // row height
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // GPATT
    gpatt_c = create_gpatt_panel(
        gps_screen,       // parent
        menu_w_px,        // width px
        menu_h_px,        // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius
        2,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        2,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        48,               // row height
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

