holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** ------------------------------------------------------------------
 * @brief Gyro Screen
 * 
 */
void display_gyro_screen()
{
    // Set Display Flag
    printf("[display_gyro_screen] setting display flag\n");
    flag_display_gyro_screen = false;

    // Check Current Screen
    printf("[display_gyro_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gyro_screen) {
        printf("[display_gyro_screen] screen already active, returning\n");
        return;
    }
    printf("[display_gyro_screen] selected new screen, attempting to load new screen\n");

    // Always create a fresh screen
    printf("[display_gyro_screen] creating screen object\n");
    gyro_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_gyro_screen] loading screen\n");
    lv_scr_load_anim(gyro_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_gyro_screen] creating default screen objects\n");
    create_default_screen_objects(gyro_screen);

    printf("[display_gyro_screen] invalidating display\n");
    lv_obj_invalidate(gyro_screen);  // Force redraw
    printf("[display_gyro_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // Gyro
    gyro_0_c = create_gyro_panel(
        gyro_screen,      // parent
        480,              // width px
        400,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius

        2,                // outer_pad_all
        4,                // inner_pad_all

        2,                // outline_padding

        2,                // main_row_padding
        4,                // main_column_padding

        2,                // sub_row_padding
        8,                // sub_column_padding

        48,               // row height

        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gyro_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** ------------------------------------------------------------------
 * @brief Display Screen
 * 
 */
void display_display_screen()
{
    // Set Display Flag
    printf("[display_display_screen] setting display flag\n");
    flag_display_display_screen = false;

    // Check Current Screen
    printf("[display_display_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == display_screen) {
        printf("[display_display_screen] screen already active, returning\n");
        return;
    }
    printf("[display_display_screen] selected new screen, attempting to load new screen\n");

    // Always create a fresh screen
    printf("[display_display_screen] creating screen object\n");
    display_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_display_screen] loading screen\n");
    lv_scr_load_anim(display_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_display_screen] creating default screen objects\n");
    create_default_screen_objects(display_screen);

    printf("[display_display_screen] invalidating display\n");
    lv_obj_invalidate(display_screen);  // Force redraw
    printf("[display_display_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render    
}

/** ------------------------------------------------------------------
 * @brief System Screen
 * 
 */
void display_system_screen()
{
    // Set Display Flag
    printf("[display_system_screen] setting display flag\n");
    flag_display_system_screen = false;

    // Check Current Screen
    printf("[display_system_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == system_screen) {
        printf("[display_system_screen] screen already active, returning\n");
        return;
    }
    printf("[display_system_screen] selected new screen, attempting to load new screen\n");

    // Always create a fresh screen
    printf("[display_system_screen] creating screen object\n");
    system_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_system_screen] loading screen\n");
    lv_scr_load_anim(system_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_system_screen] creating default screen objects\n");
    create_default_screen_objects(system_screen);

    printf("[display_system_screen] invalidating display\n");
    lv_obj_invalidate(system_screen);  // Force redraw
    printf("[display_system_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render     
}

/** ------------------------------------------------------------------
 * @brief UAP Screen
 * 
 */
void display_uap_screen()
{
    // Set Display Flag
    printf("[display_uap_screen] setting display flag\n");
    flag_display_system_screen = false;

    // Check Current Screen
    printf("[display_uap_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == uap_screen) {
        printf("[display_uap_screen] screen already active, returning\n");
        return;
    }
    printf("[display_uap_screen] selected new screen, attempting to load new screen\n");

