holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Switch Panel
                // lv_obj_set_style_outline_color(gps_switch_panel.switch_satio_panel.panel, main_contrast_outline_hue, LV_PART_MAIN);
                // lv_obj_set_style_text_color(gps_switch_panel.switch_satio_panel.label, main_contrast_title_hue, LV_PART_MAIN);

                // Panel
                lv_obj_set_style_outline_color(satio_c.panel, main_contrast_outline_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // GPS Degrees Latitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_deg_lat, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_deg_lat, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_deg_lat, String(satioData.degrees_latitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.val_deg_lat, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // GPS Degrees Longitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_deg_lon, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_deg_lon, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_deg_lon, String(satioData.degrees_longitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.val_deg_lon, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // User Degrees Latitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_user_deg_lat, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.ta_user_deg_lat, main_contrast_outline_hue, LV_PART_MAIN);
                lv_textarea_set_text(satio_c.ta_user_deg_lat, String(satioData.user_degrees_latitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.ta_user_deg_lat, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.btn_auto_set_user_lat.panel, main_contrast_outline_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // User Degrees Longitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_user_deg_lon, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.ta_user_deg_lon, main_contrast_outline_hue, LV_PART_MAIN);
                lv_textarea_set_text(satio_c.ta_user_deg_lon, String(satioData.user_degrees_longitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.ta_user_deg_lon, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.btn_auto_set_user_lon.panel, main_contrast_outline_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // System Degrees Latitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_sys_deg_lat, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_sys_deg_lat, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_sys_deg_lat, String(satioData.system_degrees_latitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.val_sys_deg_lat, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // System Degrees Longitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_sys_deg_lon, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_sys_deg_lon, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_sys_deg_lon, String(satioData.system_degrees_longitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.val_sys_deg_lon, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Location Value Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_location_mode, main_contrast_title_hue, LV_PART_MAIN);
                if (satioData.location_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_user.panel, default_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_user.label, default_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_gps.panel, default_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.location_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_gps.panel, default_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_gps.label, default_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_user.panel, default_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }

