holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // RTC Sync Altitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_rtcsync_altitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_rtcsync_altitude, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_rtcsync_altitude, String(satioData.rtcsync_altitude).c_str());
                lv_obj_set_style_text_color(satio_c.val_rtcsync_altitude, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Formatted RTC Time
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_rtc_time, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_rtc_time, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_rtc_time, String(satioData.formatted_rtc_time).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_rtc_time, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Formatted RTC Date
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_formatted_rtc_date, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_formatted_rtc_date, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_formatted_rtc_date, String(satioData.formatted_rtc_date).c_str());
                lv_obj_set_style_text_color(satio_c.val_formatted_rtc_date, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // RTC Unix Time
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_rtc_unixtime, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_rtc_unixtime, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_rtc_unixtime, String(satioData.rtc_unixtime).c_str());
                lv_obj_set_style_text_color(satio_c.val_rtc_unixtime, main_contrast_value_hue, LV_PART_MAIN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // ────────────────────────────────────────────────
                // UTC Second Offset
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_utc_second_offset, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.ta_utc_second_offset, main_contrast_outline_hue, LV_PART_MAIN);
                lv_textarea_set_text(satio_c.ta_utc_second_offset, String(satioData.utc_second_offset).c_str());
                lv_obj_set_style_text_color(satio_c.ta_utc_second_offset, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // UTC Auto Offset Flag
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_utc_auto_offset_flag, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_utc_auto_offset_flag, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_utc_auto_offset_flag, satioData.utc_auto_offset_flag ? "Yes" : "No");
                lv_obj_set_style_text_color(satio_c.val_utc_auto_offset_flag, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Set Time Automatically
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_set_time_automatically, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_set_time_automatically, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_set_time_automatically, satioData.set_time_automatically ? "Yes" : "No");
                lv_obj_set_style_text_color(satio_c.val_set_time_automatically, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // GPS Altitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_altitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_altitude, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_altitude, String(satioData.altitude).c_str());
                lv_obj_set_style_text_color(satio_c.val_altitude, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // User Altitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_user_altitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.ta_user_altitude, main_contrast_outline_hue, LV_PART_MAIN);
                lv_textarea_set_text(satio_c.ta_user_altitude, String(satioData.user_altitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.ta_user_altitude, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.btn_auto_set_user_altitude.panel, main_contrast_outline_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // System Altitude
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_sys_altitude, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_sys_altitude, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_sys_altitude, String(satioData.system_altitude, 7).c_str());
                lv_obj_set_style_text_color(satio_c.val_sys_altitude, main_contrast_value_hue, LV_PART_MAIN);

