holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // Altitude Value Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_altitude_mode, main_contrast_title_hue, LV_PART_MAIN);
                if (satioData.altitude_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_altitude_mode_user.panel, default_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_altitude_mode_user.label, default_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_altitude_mode_gps.panel, default_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_altitude_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.altitude_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_altitude_mode_gps.panel, default_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_altitude_mode_gps.label, default_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_altitude_mode_user.panel, default_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_altitude_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }

                // ────────────────────────────────────────────────
                // GPS Speed
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_speed, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_speed, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_speed, String(satioData.speed, 2).c_str());
                lv_obj_set_style_text_color(satio_c.val_speed, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // User Speed
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_user_speed, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.ta_user_speed, main_contrast_outline_hue, LV_PART_MAIN);
                lv_textarea_set_text(satio_c.ta_user_speed, String(satioData.user_speed, 2).c_str());
                lv_obj_set_style_text_color(satio_c.ta_user_speed, main_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.btn_auto_set_user_speed.panel, main_contrast_outline_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // System Speed
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_sys_speed, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_sys_speed, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_sys_speed, String(satioData.system_speed, 2).c_str());
                lv_obj_set_style_text_color(satio_c.val_sys_speed, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // Speed Value Mode
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_speed_mode, main_contrast_title_hue, LV_PART_MAIN);
                if (satioData.speed_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_user.panel, default_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_user.label, default_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_gps.panel, default_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.speed_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_gps.panel, default_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_gps.label, default_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_user.panel, default_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }

                // ────────────────────────────────────────────────
                // Ground Heading Name
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_ground_heading_name, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_ground_heading_name, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_ground_heading_name, String(satioData.ground_heading_name).c_str());
                lv_obj_set_style_text_color(satio_c.val_ground_heading_name, main_contrast_value_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // GPS Ground Heading
                // ────────────────────────────────────────────────
                lv_obj_set_style_text_color(satio_c.lbl_ground_heading, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(satio_c.val_ground_heading, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(satio_c.val_ground_heading, String(satioData.ground_heading, 2).c_str());
                lv_obj_set_style_text_color(satio_c.val_ground_heading, main_contrast_value_hue, LV_PART_MAIN);

