holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        else if (current_gps_panel==3) {
            if (gpatt_c.panel) {
                // Hide
                lv_obj_add_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Show
                lv_obj_remove_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Switch Panel
                // lv_obj_set_style_outline_color(gps_switch_panel.switch_gpatt_panel.panel, main_contrast_outline_hue, LV_PART_MAIN);
                // lv_obj_set_style_text_color(gps_switch_panel.switch_gpatt_panel.label, main_contrast_title_hue, LV_PART_MAIN);

                // Panel
                lv_obj_set_style_outline_color(gpatt_c.panel, main_outline_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_pitch, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_pitch, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_pitch, String(gpattData.pitch).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_pitch, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_roll, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_roll, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_roll, String(gpattData.roll).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_roll, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_yaw, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_yaw, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_yaw, String(gpattData.yaw).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_yaw, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_software_version, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_software_version, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_software_version, String(gpattData.software_version).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_software_version, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_product_id, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_product_id, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_product_id, String(gpattData.product_id).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_product_id, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_ins, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_ins, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_ins, String(gpattData.ins).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_ins, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_hardware_version, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_hardware_version, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_hardware_version, String(gpattData.hardware_version).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_hardware_version, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_run_state_flag, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_run_state_flag, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_run_state_flag, String(gpattData.run_state_flag).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_run_state_flag, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_mis_angle_num, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_mis_angle_num, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_mis_angle_num, String(gpattData.mis_angle_num).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_mis_angle_num, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_static_flag, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_static_flag, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_static_flag, String(gpattData.static_flag).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_static_flag, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_user_code, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_user_code, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_user_code, String(gpattData.user_code).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_user_code, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_gst_data, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_gst_data, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_gst_data, String(gpattData.gst_data).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_gst_data, main_contrast_value_hue, LV_PART_MAIN);

                lv_obj_set_style_text_color(gpatt_c.lbl_line_flag, main_contrast_title_hue, LV_PART_MAIN);
                lv_obj_set_style_outline_color(gpatt_c.val_line_flag, main_contrast_outline_hue, LV_PART_MAIN);
                lv_label_set_text(gpatt_c.val_line_flag, String(gpattData.line_flag).c_str());
                lv_obj_set_style_text_color(gpatt_c.val_line_flag, main_contrast_value_hue, LV_PART_MAIN);

