holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Menu styling (menus are bootstrapped for consistant reproducibility so minimal styling is needed here)
    font_menu_title = &cobalt_alien_25;
    font_menu_item = &cobalt_alien_17;

    // Default Major
    default_bg_hue      = lv_color_make(0,0,0);
    default_outline_hue = lv_color_make(28,28,28); // used instead of border
    default_border_hue  = lv_color_make(0,0,0); // hidden by making same as bg
    default_shadow_hue  = lv_color_make(0,0,0);
    default_title_hue   = lv_color_make(0,0, 255);
    default_value_hue   = lv_color_make(0,255,0);
    // Default Minor
    default_contrast_bg_hue      = lv_color_make(14,14,14);
    default_contrast_outline_hue = lv_color_make(28,28,28); // used instead of border
    default_contrast_border_hue  = lv_color_make(0,0,0); // hidden by making same as bg
    default_contrast_shadow_hue  = lv_color_make(0,0,0);
    default_contrast_title_hue   = lv_color_make(0,0, 255);
    default_contrast_value_hue   = lv_color_make(0,255,0);

    // Default Off
    default_off_outline_hue = lv_color_make(28,28,28); // used instead of border
    default_off_title_hue   = lv_color_make(28,28,28);
    default_off_value_hue   = lv_color_make(28,28,28);
    // Default On
    default_on_outline_hue = lv_color_make(28,28,28); // used instead of border
    default_on_title_hue   = lv_color_make(0,255,0);
    default_on_value_hue   = lv_color_make(0,255,0);

    // Custom Major (can be changed by user)
    custom_bg_hue      = lv_color_make(0,0,0);
    custom_outline_hue = lv_color_make(0,0,0); // used instead of border
    custom_border_hue  = lv_color_make(0,0,0); // hidden by making same as bg
    custom_shadow_hue  = lv_color_make(0,0,0);
    custom_title_hue   = lv_color_make(0,0, 255);
    custom_value_hue   = lv_color_make(0,255,0);
    // Custom Minor (can be changed by user)
    custom_contrast_bg_hue      = lv_color_make(0,0,0);
    custom_contrast_outline_hue = lv_color_make(0,0,0); // used instead of border
    custom_contrast_border_hue  = lv_color_make(0,0,0); // hidden by making same as bg
    custom_contrast_shadow_hue  = lv_color_make(0,0,0);
    custom_contrast_title_hue   = lv_color_make(0,0, 255);
    custom_contrast_value_hue   = lv_color_make(0,255,0);

    // Rainbow Hue Major
    rainbow_outline_hue = lv_color_make(0,0,0); // used instead of border
    rainbow_title_hue   = lv_color_make(0,0,255);
    rainbow_value_hue   = lv_color_make(0,255,0);
    // Rainbow Hue Minor
    rainbow_contrast_outline_hue = lv_color_make(0,0,0); // used instead of border
    rainbow_contrast_title_hue   = lv_color_make(0,0,255);
    rainbow_contrast_value_hue   = lv_color_make(0,255,0);


    // Set Current Pallette
    enable_rainbow_effect=false;
    setColorsDefault();

    // --------------------------------------------------------------
    // SD Card Initialization
    // --------------------------------------------------------------
    mount_sd();
    
    is_fs_ready("/sdcard"); // check mount
    
    list_directory("/sdcard"); // check read sdcard
    
    delay(1000);

    sd_lvgl_register(); // register file related callback functions with LVGL

    // --------------------------------------------------------------
    // Display Loading Screen
    // --------------------------------------------------------------
    display_loading_screen();
}

void satio_ui_begin() {
    display_timer = lv_timer_create(update_display_on_timer, 50, NULL);
}
